orgs/euler.org
#+hugo_base_dir: ~/notes/
#+hugo_section: docs/algorithm
#+title: Project Euler

** 1.Multiples of 3 or 5
If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.
Find the sum of all the multiples of 3 or 5 below 1000.
#+begin_src C++
  #include <iostream>

  int main() {
      int ans = 0;
      for (int i = 0; i < 1000; i++) {
	  if (i % 3 == 0 || i % 5 == 0) {
	      ans += i;
	  }
      }
      std::cout << ans << std::endl;
      return 0;
  }
#+end_src

#+RESULTS:
: 233168

** 2.Even Fibonacci Numbers
Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:
\[1,2,3\]
